Revit 2024 API
SpatialFieldManager.Clear Method
 Clear all analysis results managed by this manager object
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public void Clear()
Visual Basic
Public Sub Clear
Visual C++
public:
void Clear()
See Also
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace